tutorials/fluidSolidInteraction/microBeamInCrossFlow/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface    Aitken;

AitkenCoeffs
{
    // Solid interface patch list
    solidPatch interface;

    // Fluid interface patch list
    fluidPatch interface;

    // Fixed under-relaxation factor
    // Some methods use this as the initial factor
    relaxationFactor 0.02;

    // The entire fluid domain mesh is moved when the interface moves more
    // than this limit
    interfaceDeformationLimit 0;

    // Tolerance for the FSI outer loop
    outerCorrTolerance 1e-3;

    // Maximum number of FSI outer iterations
    nOuterCorr 50;

    // Frequency at which the weights of interpolator between the fluid and
    // solid interface is updated
    // 0 means there will be no interpolator update during simulation, whereas
    // 10 means the interpolator will be updated every 10 time-steps
    interpolatorUpdateFrequency 0;

    // Enable FSI coupling
    coupled    yes;
}

// ************************************************************************* //
