tutorials/fluidSolidInteraction/microBeamInCrossFlow/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solidModel     nonLinearGeometryTotalLagrangianTotalDisplacement;

nonLinearGeometryTotalLagrangianTotalDisplacementCoeffs
{
    // Maximum number of momentum correctors
    //nCorrectors             1000;

    // Solution tolerance for displacement
    solutionTolerance       1e-05;

    // Alternative solution tolerance for displacement
    alternativeTolerance    1e-05;

    // Material law solution tolerance
    //materialTolerance       1e-05;

    // Write frequency for the residuals
    infoFrequency           1000;
}

// ************************************************************************* //
