tutorials/fluidSolidInteraction/microBeamInCrossFlow/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        //type            fixedValue;
        //value           uniform (3.5e-05 0 0);

        type            pulsedParabolicVelocity;
        steadyValue     0.05;
        t1              0.04;
        t2              0.1;
        n               (1 0 0);
        y               (0 1 0);
        transitionPeriod 0.01;
        boundBoxMin     (0 0 0);
        boundBoxMax     (0 0.0001 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    interface
    {
        type            newMovingWallVelocity;
        value           uniform (0 0 0);
    }
    backPlane
    {
        type            empty;
    }
    frontPlane
    {
        type            empty;
    }
}

// ************************************************************************* //
