tutorials/fluidSolidInteraction/microBeamInCrossFlow/Allrun
#!/bin/bash

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Source solids4Foam scripts
source solids4FoamScripts.sh

solids4Foam::caseDoesNotRunWithOpenFOAMOrg

# Check case version is correct
solids4Foam::convertCaseFormat .

if ! command -v cartesianMesh &> /dev/null
then
    echo
    echo "cartesianMesh command not found, which is required for this case"
    echo
    exit 0
fi

# Create solid mesh
cp system/solid/meshDict system/
solids4Foam::runApplication -s solid cartesian2DMesh
mkdir -p constant/solid/polyMesh
\mv constant/polyMesh/* constant/solid/polyMesh/

# Create fluid mesh
cp system/fluid/meshDict system/
solids4Foam::runApplication -s fluid cartesian2DMesh
mkdir -p constant/fluid/polyMesh
\mv constant/polyMesh/* constant/fluid/polyMesh/

if [[ "${WM_PROJECT}" == "foam" ]]
then
    # Correct patch types
    solids4Foam::runApplication -s fluid createPatch -overwrite -region fluid
    solids4Foam::runApplication -s solid createPatch -overwrite -region solid
else
    # Correct patch types
    foamDictionary constant/fluid/polyMesh/boundary \
                   -entry entry0.frontPlane.type \
                   -set empty &> log.foamDictionary.fluid.front
    foamDictionary constant/fluid/polyMesh/boundary \
                   -entry entry0.backPlane.type \
                   -set empty &> log.foamDictionary.fluid.back
    foamDictionary constant/solid/polyMesh/boundary \
                   -entry entry0.frontPlane.type \
                   -set empty &> log.foamDictionary.solid.front
    foamDictionary constant/solid/polyMesh/boundary \
                   -entry entry0.backPlane.type \
                   -set empty &> log.foamDictionary.solid.back
fi

# Scale from microns to metres
echo "Running transformPoints on the fluid"
transformPoints -scale "(1e-6 1e-6 1e-6)" -region fluid > log.transformPoints.fluid
echo "Running transformPoints on the solid"
transformPoints -scale "(1e-6 1e-6 1e-6)" -region solid > log.transformPoints.solid

# Run the solver
solids4Foam::runApplication solids4Foam
